const cityA= { town: []}

const getTownSectionObject = (townObj = {}) => {
  const {name, id: admit} = townObj
  const targetTown = {
    name,
    id: admit,
    sectionList: []
  }

  const s_op = (sectionName, sectionId) => {
    targetTown.sectionList.push({
      name: sectionName,
      id:   sectionId
    })
  }

  if (admit=="01")
  {
  s_op("西松段一小段","0600");s_op("西松段二小段","0601");s_op("美仁段一小段","0602");s_op("美仁段二小段","0603");s_op("寶清段一小段","0604");s_op("寶清段二小段","0605");s_op("寶清段三小段","0606");s_op("寶清段四小段","0607");s_op("寶清段五小段","0608");s_op("延吉段一小段","0609");s_op("延吉段三小段","0611");s_op("延壽段一小段","0613");s_op("敦化段一小段","0614");s_op("敦化段二小段","0615");s_op("敦化段三小段","0616");s_op("濱江段一小段","0620");s_op("濱江段二小段","0621");s_op("濱江段四小段","0623");s_op("民生段","0655");s_op("西松段三小段","0704");s_op("敦化段四小段","0705");s_op("敦化段五小段","0706");s_op("寶清段六小段","0711");s_op("寶清段七小段","0712");
  } 
  if (admit=="02")
  {
  s_op("龍泉段一小段","0021");s_op("龍泉段二小段","0022");s_op("龍泉段三小段","0023");s_op("金華段一小段","0200");s_op("金華段二小段","0201");s_op("金華段三小段","0202");s_op("金華段四小段","0203");s_op("瑞安段一小段","0207");s_op("瑞安段二小段","0208");s_op("瑞安段三小段","0209");s_op("瑞安段四小段","0210");s_op("通化段一小段","0211");s_op("通化段二小段","0212");s_op("通化段三小段","0213");s_op("通化段四小段","0214");s_op("通化段五小段","0215");s_op("通化段六小段","0216");s_op("仁愛段一小段","0217");s_op("仁愛段二小段","0218");s_op("仁愛段三小段","0219");s_op("仁愛段四小段","0220");s_op("學府段一小段","0221");s_op("學府段二小段","0222");s_op("學府段三小段","0223");s_op("學府段四小段","0224");s_op("復興段一小段","0225");s_op("復興段二小段","0226");s_op("復興段三小段","0227");s_op("大安段一小段","0228");s_op("大安段二小段","0229");s_op("大安段三小段","0230");s_op("懷生段一小段","0235");s_op("懷生段二小段","0236");s_op("懷生段三小段","0237");s_op("懷生段四小段","0238");s_op("辛亥段一小段","0239");s_op("辛亥段三小段","0241");s_op("辛亥段四小段","0242");s_op("辛亥段五小段","0243");s_op("仁愛段五小段","1201");s_op("仁愛段六小段","1202");s_op("辛亥段六小段","1203");
  } 
  if (admit=="03")
  {
  s_op("永昌段一小段","0001");s_op("永昌段二小段","0002");s_op("永昌段三小段","0003");s_op("永昌段四小段","0004");s_op("永昌段五小段","0005");s_op("河堤段一小段","0008");s_op("河堤段二小段","0009");s_op("河堤段三小段","0010");s_op("河堤段四小段","0011");s_op("河堤段五小段","0012");s_op("河堤段六小段","0013");s_op("南海段一小段","0014");s_op("南海段二小段","0015");s_op("南海段三小段","0016");s_op("南海段四小段","0017");s_op("南海段五小段","0018");s_op("福和段一小段","0019");s_op("福和段二小段","0020");s_op("永昌段六小段","0157");s_op("水源段","0158");s_op("中正段一小段","0204");s_op("中正段二小段","0205");s_op("中正段三小段","0206");s_op("臨沂段一小段","0231");s_op("臨沂段二小段","0232");s_op("臨沂段三小段","0233");s_op("臨沂段四小段","0234");s_op("成功段一小段","0248");s_op("成功段二小段","0249");s_op("成功段三小段","0250");s_op("公園段一小段","0251");s_op("公園段二小段","0252");s_op("公園段三小段","0253");s_op("城中段一小段","0254");s_op("城中段二小段","0255");s_op("城中段三小段","0256");
  } 
  if (admit=="05")
  {
  s_op("青年段一小段","0006");s_op("青年段二小段","0007");s_op("雙園段一小段","0024");s_op("雙園段二小段","0025");s_op("雙園段三小段","0026");s_op("莒光段一小段","0027");s_op("莒光段二小段","0028");s_op("莒光段三小段","0029");s_op("莒光段四小段","0030");s_op("華中段一小段","0031");s_op("華中段二小段","0032");s_op("華中段三小段","0033");s_op("華中段四小段","0034");s_op("華江段一小段","0035");s_op("華江段二小段","0036");s_op("華江段三小段","0037");s_op("萬大段一小段","0038");s_op("萬大段二小段","0039");s_op("直興段一小段","0040");s_op("直興段二小段","0041");s_op("直興段三小段","0042");s_op("萬華段一小段","0043");s_op("萬華段二小段","0044");s_op("漢中段一小段","0045");s_op("漢中段二小段","0046");s_op("漢中段三小段","0047");s_op("龍山段一小段","0048");s_op("龍山段二小段","0049");s_op("福星段一小段","0244");s_op("福星段二小段","0245");s_op("福星段三小段","0246");s_op("福星段四小段","0247");
  } 
  if (admit=="09")
  {
  s_op("圓環段一小段","0257");s_op("圓環段二小段","0258");s_op("圓環段三小段","0259");s_op("市府段一小段","0260");s_op("市府段二小段","0261");s_op("市府段三小段","0262");s_op("延平段一小段","0263");s_op("延平段二小段","0264");s_op("延平段三小段","0265");s_op("玉泉段一小段","0266");s_op("玉泉段二小段","0267");s_op("迪化段一小段","0268");s_op("迪化段二小段","0269");s_op("迪化段三小段","0270");s_op("大龍段一小段","0271");s_op("大龍段二小段","0272");s_op("大龍段三小段","0273");s_op("橋北段一小段","0274");s_op("橋北段二小段","0275");s_op("橋北段三小段","0276");s_op("大同段一小段","0277");s_op("大同段二小段","0278");s_op("文昌段一小段","0279");s_op("文昌段二小段","0280");s_op("雙連段一小段","0281");s_op("雙連段二小段","0282");s_op("雙連段三小段","0283");
  } 
  if (admit=="10")
  {
  s_op("中山段一小段","0400");s_op("中山段二小段","0401");s_op("中山段三小段","0402");s_op("中山段四小段","0403");s_op("北安段一小段","0405");s_op("北安段二小段","0406");s_op("北安段三小段","0407");s_op("北安段四小段","0408");s_op("正義段一小段","0410");s_op("正義段二小段","0411");s_op("正義段三小段","0412");s_op("正義段四小段","0413");s_op("吉林段一小段","0414");s_op("吉林段二小段","0415");s_op("吉林段三小段","0416");s_op("吉林段四小段","0417");s_op("吉林段五小段","0418");s_op("長安段一小段","0419");s_op("長安段二小段","0420");s_op("長安段三小段","0421");s_op("長安段四小段","0422");s_op("長春段一小段","0423");s_op("長春段二小段","0424");s_op("長春段三小段","0425");s_op("榮星段二小段","0427");s_op("榮星段三小段","0428");s_op("榮星段四小段","0429");s_op("榮星段五小段","0430");s_op("榮星段六小段","0431");s_op("榮星段七小段","0432");s_op("德惠段一小段","0434");s_op("德惠段二小段","0435");s_op("德惠段三小段","0436");s_op("德惠段四小段","0437");s_op("大佳段一小段","0513");s_op("大佳段二小段","0514");s_op("金泰段","0520");
  } 
  if (admit=="11")
  {
  s_op("景美段一小段","0050");s_op("景美段二小段","0051");s_op("景美段三小段","0052");s_op("景美段四小段","0053");s_op("景美段五小段","0054");s_op("萬慶段一小段","0055");s_op("萬慶段二小段","0056");s_op("萬慶段三小段","0057");s_op("萬隆段一小段","0058");s_op("萬隆段二小段","0059");s_op("興隆段一小段","0060");s_op("興隆段二小段","0061");s_op("興隆段三小段","0062");s_op("興隆段四小段","0063");s_op("興安段一小段","0064");s_op("興安段二小段","0065");s_op("興安段三小段","0066");s_op("興安段四小段","0067");s_op("木新段三小段","0069");s_op("華興段一小段","0070");s_op("華興段二小段","0071");s_op("華興段三小段","0072");s_op("華興段四小段","0073");s_op("實踐段一小段","0074");s_op("實踐段二小段","0075");s_op("實踐段三小段","0076");s_op("萬芳段一小段","0115");s_op("公訓段一小段","0117");s_op("公訓段二小段","0118");s_op("公訓段三小段","0119");s_op("興泰段一小段","0120");s_op("興泰段二小段","0121");s_op("興泰段三小段","0122");s_op("萬芳段二小段","0123");s_op("萬芳段三小段","0124");s_op("木柵段一小段","0125");s_op("木柵段二小段","0126");s_op("木柵段三小段","0127");s_op("木柵段四小段","0128");s_op("富德段一小段","0129");s_op("富德段二小段","0130");s_op("富德段三小段","0131");s_op("博嘉段一小段","0132");s_op("博嘉段二小段","0133");s_op("博嘉段三小段","0134");s_op("老泉段一小段","0135");s_op("老泉段二小段","0136");s_op("老泉段三小段","0137");s_op("老泉段四小段","0138");s_op("指南段一小段","0139");s_op("指南段二小段","0140");s_op("指南段三小段","0141");s_op("指南段四小段","0142");s_op("頭廷段一小段","0143");s_op("頭廷段二小段","0144");s_op("頭廷段三小段","0145");s_op("頭廷段四小段","0146");s_op("草湳段一小段","0147");s_op("草湳段二小段","0148");s_op("草湳段三小段","0149");s_op("政大段一小段","0150");s_op("政大段二小段","0151");s_op("政大段三小段","0152");s_op("政大段四小段","0153");s_op("政大段五小段","0154");s_op("萬芳段四小段","0155");s_op("博嘉段四小段","0156");
  } 
  if (admit=="13")
  {
  s_op("大豐段一小段","0656");s_op("大豐段二小段","0657");s_op("大豐段三小段","0658");s_op("中南段一小段","0659");s_op("中南段二小段","0660");s_op("中南段三小段","0661");s_op("中南段四小段","0662");s_op("中南段五小段","0663");s_op("玉成段一小段","0664");s_op("玉成段二小段","0665");s_op("玉成段三小段","0666");s_op("玉成段四小段","0667");s_op("玉成段五小段","0668");s_op("南港段一小段","0669");s_op("南港段二小段","0670");s_op("南港段三小段","0671");s_op("南港段四小段","0672");s_op("新光段一小段","0673");s_op("新光段二小段","0674");s_op("新光段三小段","0675");s_op("舊莊段一小段","0676");s_op("舊莊段二小段","0677");s_op("舊莊段三小段","0678");s_op("舊莊段四小段","0679");s_op("麗山段一小段","0680");s_op("麗山段二小段","0681");s_op("麗山段三小段","0682");s_op("麗山段四小段","0683");s_op("麗山段五小段","0684");s_op("橫科段橫科小段","0685");s_op("橫科段南港子小段","0686");s_op("後山坡段","0699");s_op("南港三重埔段","0700");s_op("後山段","0701");s_op("東新庄子段","0702");s_op("經貿段","0713");s_op("向陽段","0714");
  } 
  if (admit=="14")
  {
  s_op("文德段一小段","0453");s_op("文德段二小段","0454");s_op("文德段三小段","0455");s_op("文德段四小段","0456");s_op("西湖段一小段","0457");s_op("西湖段二小段","0458");s_op("康寧段一小段","0460");s_op("康寧段二小段","0461");s_op("康寧段三小段","0462");s_op("康寧段四小段","0463");s_op("碧湖段一小段","0464");s_op("碧湖段二小段","0465");s_op("碧湖段三小段","0466");s_op("碧湖段四小段","0467");s_op("碧湖段五小段","0468");s_op("潭美段一小段","0469");s_op("潭美段二小段","0470");s_op("潭美段三小段","0471");s_op("潭美段四小段","0472");s_op("東湖段一小段","0473");s_op("東湖段二小段","0474");s_op("東湖段三小段","0475");s_op("新里族段灣子小段","0479");s_op("新里族十四分小段","0480");s_op("東湖段四小段","0486");s_op("大湖段一小段","0490");s_op("大湖段二小段","0491");s_op("大湖段三小段","0492");s_op("大湖段四小段","0493");s_op("東湖段五小段","0494");s_op("東湖段六小段","0495");s_op("東湖段七小段","0496");s_op("康寧段五小段","0497");s_op("新里族段羊稠小段","0498");s_op("新里族段洲尾小段","0499");s_op("碧山段一小段","0507");s_op("碧山段二小段","0508");s_op("碧山段三小段","0509");s_op("石潭段一小段","0510");s_op("石潭段二小段","0511");s_op("石潭段三小段","0512");s_op("社后段社后下小段","0515");s_op("東湖段八小段","0516");s_op("文德段五小段","0517");s_op("西湖段四小段","0518");s_op("石潭段四小段","0519");s_op("舊宗段","0521");s_op("安康段","0522");s_op("潭美段五小段","0523");s_op("石潭段五小段","0524");
  } 
  if (admit=="15")
  {
  s_op("天母段一小段","0800");s_op("天母段二小段","0801");s_op("天母段三小段","0802");s_op("天母段四小段","0803");s_op("蘭雅段一小段","0804");s_op("蘭雅段二小段","0805");s_op("蘭雅段三小段","0806");s_op("百齡段一小段","0807");s_op("百齡段二小段","0808");s_op("百齡段三小段","0809");s_op("百齡段四小段","0810");s_op("百齡段五小段","0811");s_op("光華段一小段","0812");s_op("光華段二小段","0813");s_op("光華段三小段","0814");s_op("光華段四小段","0815");s_op("陽明段一小段","0816");s_op("陽明段二小段","0817");s_op("陽明段三小段","0818");s_op("陽明段四小段","0819");s_op("福林段一小段","0820");s_op("福林段二小段","0821");s_op("福林段三小段","0822");s_op("三玉段一小段","0823");s_op("三玉段二小段","0824");s_op("三玉段三小段","0825");s_op("三玉段四小段","0826");s_op("三玉段五小段","0827");s_op("芝山段一小段","0828");s_op("芝山段二小段","0829");s_op("芝山段三小段","0830");s_op("福順段一小段","0831");s_op("福順段二小段","0832");s_op("福順段三小段","0833");s_op("永新段一小段","0834");s_op("永新段二小段","0835");s_op("永新段三小段","0836");s_op("永新段四小段","0837");s_op("海光段一小段","0838");s_op("海光段二小段","0839");s_op("海光段三小段","0840");s_op("中洲段","0841");s_op("溪洲段一小段","0842");s_op("溪洲段二小段","0843");s_op("溪洲段三小段","0844");s_op("富安段一小段","0845");s_op("富安段二小段","0846");s_op("富安段三小段","0847");s_op("永平段一小段","0848");s_op("永平段二小段","0849");s_op("永平段三小段","0850");s_op("永平段四小段","0851");s_op("天山段一小段","0852");s_op("天山段二小段","0853");s_op("雙溪段重劃一小段","0854");s_op("雙溪段外雙溪小段","0855");s_op("雙溪段內雙溪小段","0856");s_op("永福段拔子埔小段","0857");s_op("永福段莊子頂小段","0858");s_op("下東勢段","0859");s_op("公館地段燒?寮小段","0860");s_op("公館地段新安小段","0861");s_op("公館地段尾崙小段","0862");s_op("坪頂段大平尾小段","0863");s_op("坪頂段狗慇懃小段","0864");s_op("菁礐段竹篙嶺小段","0865");s_op("菁礐段大庄小段","0866");s_op("菁礐段番子樹空小段","0867");s_op("菁礐段頭湖小段","0868");s_op("草山段冷水坑小段","0869");s_op("草山段磺溪內小段","0870");s_op("草山段山豬湖小段","0871");s_op("草山段草山小段","0872");s_op("草山段山子後小段","0873");s_op("七股段","0874");s_op("石角段員山子?小段","0875");s_op("石角段大石角小段","0876");s_op("石角段玉稠湖小段","0877");s_op("三角埔段大稻埕小段","0878");s_op("三角埔段猴洞小段","0879");s_op("三角埔段玉潮坑小段","0880");s_op("三角埔段三角埔小段","0881");s_op("光華段五小段","0943");s_op("至善段一小段","0944");s_op("至善段二小段","0945");s_op("至善段三小段","0946");s_op("至善段四小段","0947");s_op("至善段五小段","0948");s_op("至善段六小段","0949");s_op("翠山段一小段","0950");s_op("翠山段二小段","0951");s_op("力行段一小段","0953");s_op("力行段二小段","0954");s_op("力行段三小段","0955");s_op("芝蘭段一小段","0956");s_op("芝蘭段二小段","0957");s_op("芝蘭段三小段","0958");s_op("芝蘭段四小段","0959");s_op("華岡段一小段","0960");s_op("華岡段二小段","0961");s_op("華岡段三小段","0962");s_op("華岡段四小段","0963");s_op("平等段一小段","0964");s_op("平等段二小段","0965");s_op("平等段三小段","0966");s_op("天玉段一小段","0967");s_op("天玉段二小段","0968");s_op("天玉段三小段","0969");s_op("菁山段一小段","0970");s_op("菁山段二小段","0971");s_op("溪山段一小段","0972");s_op("溪山段二小段","0973");s_op("溪山段三小段","0974");s_op("至善段七小段","0996");s_op("華岡段五小段","0997");s_op("新安段一小段","0998");s_op("新安段五小段","0999");s_op("百齡段六小段","1002");s_op("新安段二小段","1003");s_op("新安段三小段","1004");s_op("新安段四小段","1005");s_op("福德洋段福德洋小段","1006");s_op("福德洋段舊街小段","1007");s_op("福德洋段洲尾頭小段","1008");s_op("林子口段林子口小段","1009");s_op("社子段葫蘆堵小段","1010");s_op("湳雅段德行小段","1011");s_op("新安段六小段","1013");
  } 
  if (admit=="16")
  {
  s_op("振興段一小段","0883");s_op("振興段二小段","0884");s_op("振興段三小段","0885");s_op("振興段四小段","0886");s_op("文林段一小段","0887");s_op("文林段二小段","0888");s_op("文林段三小段","0889");s_op("文林段四小段","0890");s_op("文林段五小段","0891");s_op("立農段一小段","0892");s_op("立農段二小段","0893");s_op("立農段三小段","0894");s_op("立農段四小段","0895");s_op("立農段五小段","0896");s_op("新民段一小段","0897");s_op("新民段二小段","0898");s_op("新民段三小段","0899");s_op("新民段四小段","0900");s_op("開明段一小段","0901");s_op("開明段二小段","0902");s_op("開明段三小段","0903");s_op("大業段一小段","0904");s_op("大業段二小段","0905");s_op("大業段三小段","0906");s_op("大業段四小段","0907");s_op("溫泉段一小段","0908");s_op("溫泉段二小段","0909");s_op("溫泉段三小段","0910");s_op("溫泉段四小段","0911");s_op("奇岩段一小段","0912");s_op("奇岩段二小段","0913");s_op("奇岩段三小段","0914");s_op("奇岩段四小段","0915");s_op("奇岩段五小段","0916");s_op("竹子湖段","0917");s_op("頂北投段山?小段","0918");s_op("頂北投段十八分小段","0919");s_op("頂北投段紗帽山小段","0920");s_op("北投段","0921");s_op("唭哩岸段","0922");s_op("嗄嘮別段嗄嘮別小段","0923");s_op("石牌段","0925");s_op("桃源段一小段","0926");s_op("桃源段二小段","0927");s_op("桃源段三小段","0928");s_op("秀山段一小段","0929");s_op("秀山段二小段","0930");s_op("秀山段三小段","0931");s_op("關渡段一小段","0932");s_op("關渡段二小段","0933");s_op("關渡段三小段","0934");s_op("八仙段一小段","0935");s_op("八仙段二小段","0936");s_op("豐年段一小段","0937");s_op("豐年段二小段","0938");s_op("豐年段三小段","0939");s_op("豐年段四小段","0940");s_op("洲美段一小段","0941");s_op("洲美段二小段","0942");s_op("大業段五小段","0952");s_op("行義段一小段","0975");s_op("行義段二小段","0976");s_op("行義段三小段","0977");s_op("行義段四小段","0978");s_op("崇仰段一小段","0979");s_op("崇仰段二小段","0980");s_op("崇仰段三小段","0981");s_op("崇仰段四小段","0982");s_op("泉源段一小段","0983");s_op("泉源段二小段","0984");s_op("泉源段三小段","0985");s_op("泉源段四小段","0986");s_op("大屯段一小段","0987");s_op("大屯段二小段","0988");s_op("大屯段三小段","0989");s_op("大屯段四小段","0990");s_op("湖山段一小段","0991");s_op("湖山段二小段","0992");s_op("湖山段三小段","0993");s_op("湖田段一小段","0994");s_op("湖田段二小段","0995");s_op("桃源段四小段","1000");s_op("桃源段五小段","1001");s_op("奇岩段六小段","1012");s_op("三合段","1014");s_op("新洲美段","1015");s_op("軟橋段","1016");
  } 
  if (admit=="17")
  {
  s_op("逸仙段二小段","0618");s_op("逸仙段三小段","0619");s_op("三興段一小段","0624");s_op("三興段二小段","0625");s_op("三興段三小段","0626");s_op("永春段一小段","0627");s_op("永春段二小段","0628");s_op("永春段三小段","0629");s_op("永吉段一小段","0630");s_op("永吉段二小段","0631");s_op("永吉段三小段","0632");s_op("永吉段四小段","0633");s_op("虎林段一小段","0634");s_op("虎林段三小段","0636");s_op("虎林段四小段","0637");s_op("吳興段一小段","0638");s_op("吳興段二小段","0639");s_op("吳興段三小段","0640");s_op("信義段一小段","0641");s_op("信義段二小段","0642");s_op("祥和段一小段","0643");s_op("祥和段二小段","0644");s_op("祥和段三小段","0645");s_op("祥和段四小段","0646");s_op("雅祥段一小段","0647");s_op("雅祥段二小段","0648");s_op("雅祥段三小段","0649");s_op("雅祥段四小段","0650");s_op("福德段一小段","0651");s_op("福德段二小段","0652");s_op("福德段三小段","0653");s_op("福德段四小段","0654");s_op("信義段三小段","0687");s_op("信義段四小段","0688");s_op("信義段五小段","0689");s_op("虎林段五小段","0703");s_op("&#29314;和段一小段","0707");s_op("&#29314;和段二小段","0708");s_op("&#29314;和段三小段","0709");s_op("&#29314;和段四小段","0710");
  }

  return targetTown
}

const fillZero = (i) => i<10? `0${i}` : `${i}`

const townList = [
{name: "松山區",id:"01"},
{name: "大安區",id:"02"},
{name: "中正區",id:"03"},
{name: "萬華區",id:"05"},
{name: "大同區",id:"09"},
{name: "中山區",id:"10"},
{name: "文山區",id:"11"},
{name: "南港區",id:"13"},
{name: "內湖區",id:"14"},
{name: "士林區",id:"15"},
{name: "北投區",id:"16"},
{name: "信義區",id:"17"},
]

for(const townObj of townList){
  const targetTown = getTownSectionObject(townObj)
  cityA.town.push(targetTown)
}

module.exports = cityA
// require('fs').writeFileSync('./temp/cityA.json', JSON.stringify(cityA))


